In [3]:
import pandas as pd
import numpy as np

In [4]:
data = {
    "Student": ["Tanmay", "Vivek", "Rohan", "Raghav", "Rounak", "Aaditya"],
    "Age": [19, 20, 19, np.nan, np.nan, 19],
    "Marks": [97, np.nan, 95, 97, 96, np.nan],
    "City": ["Ghaziabad", "Jaipur", "Jaipur", "Sonipat", "Nalanda", np.nan]
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   Student   Age  Marks       City
0   Tanmay  19.0   97.0  Ghaziabad
1    Vivek  20.0    NaN     Jaipur
2    Rohan  19.0   95.0     Jaipur
3   Raghav   NaN   97.0    Sonipat
4   Rounak   NaN   96.0    Nalanda
5  Aaditya  19.0    NaN        NaN

In [7]:
mean_age = df["Age"].mean()
print(mean_age)

19.25

In [22]:
df["Age"] = df["Age"].fillna(mean_age)

In [23]:
df

   Student    Age  Marks       City
0   Tanmay  19.00   97.0  Ghaziabad
1    Vivek  20.00   96.5     Jaipur
2    Rohan  19.00   95.0     Jaipur
3   Raghav  19.25   97.0    Sonipat
4   Rounak  19.25   96.0    Nalanda
5  Aaditya  19.00   96.5     Jaipur

In [24]:
median_marks = df["Marks"].median()
df["Marks"] = df["Marks"].fillna(median_marks)

In [25]:
mode_city = df["City"].mode()[0]
print(mode_city)
df["City"] = df["City"].fillna(mode_city)

Jaipur

In [26]:
df

   Student    Age  Marks       City
0   Tanmay  19.00   97.0  Ghaziabad
1    Vivek  20.00   96.5     Jaipur
2    Rohan  19.00   95.0     Jaipur
3   Raghav  19.25   97.0    Sonipat
4   Rounak  19.25   96.0    Nalanda
5  Aaditya  19.00   96.5     Jaipur